# Salaries

In [1]:
import pandas as pd

In [2]:
salary = pd.read_csv('../Capstone_csv_file/salaries_17.csv')

In [3]:
salary.dtypes

name      object
salary    object
dtype: object

In [4]:
salary['salary'] = salary['salary'].str.replace('$', '').copy()

In [5]:
salary['salary'] = salary['salary'].str.replace(',', '').astype('int64').copy()

In [6]:
salary.dtypes

name      object
salary     int64
dtype: object

In [7]:
salary.rename(columns = {'name':'NAME'}, inplace = True)

In [8]:
salary.set_index('NAME', inplace = True)

In [9]:
salary.to_csv('../Capstone_csv_file/salary_edited_to_fit_17-18')

In [10]:
salary

                    salary
NAME
Matthew Stafford  27000000
Derek Carr        25000000
Andrew Luck       24594000
Carson Palmer     24350000
Drew Brees        24250000
...                    ...
Chris Carter        885000
Davis Webb          884230
Arrelious Benn      882500
C.J. Beathard       882162
Duke Riley          879438

[1000 rows x 1 columns]